# model={'fav': '总冠军', 'age': 31} #数据
# with open("test.json",'w',encoding='utf-8') as json_file:
#         json.dump(model,json_file,ensure_ascii=False)

def json():
    import json
    with open("test.json", 'a', encoding='utf-8') as json_file:
        model = json.load(json_file)
        print(model['fav'])

    db_name = {'剧目': 'plans'}


# 处理文件到读写
def text():
    # a+是接着写，w+是覆盖
    with open("test.txt", 'a+', encoding='utf-8') as test:
        # dd = test.read() + '99'  # 读取内容，然后处理后，覆盖源文件
        test.write('测试数据')
        test.close()

#字符
def zifu():
    # string = "hello"# %s打印时结果是hello 
    # print("string=%s" % string)# output: string=hello 
    #    
    # # %2s意思是字符串长度为2，当原字符串的长度超过2时，按原长度打印，所以%2s的打印结果还是hello 
    # print
    # "string=%2s" % string    # output: string=hello 
    #    
    # # %7s意思是字符串长度为7，当原字符串的长度小于7时，在原字符串左侧补空格， 
    # # 所以%7s的打印结果是 hello 
    # print
    # "string=%7s" % string    # output: string= hello 
    #    
    # # %-7s意思是字符串长度为7，当原字符串的长度小于7时，在原字符串右侧补空格， 
    # # 所以%-7s的打印结果是 hello 
    # print
    # "string=%-7s!" % string    # output: string=hello ! 
    #    
    # # %.2s意思是截取字符串的前2个字符，所以%.2s的打印结果是he 
    # print
    # "string=%.2s" % string   # output: string=he 
    #    
    # # %.7s意思是截取字符串的前7个字符，当原字符串长度小于7时，即是字符串本身， 
    # # 所以%.7s的打印结果是hello 
    # print
    # "string=%.7s" % string   # output: string=hello 
    #    
    # # %a.bs这种格式是上面两种格式的综合，首先根据小数点后面的数b截取字符串， 
    # # 当截取的字符串长度小于a时，还需要在其左侧补空格 
    # print
    # "string=%7.2s" % string   # output: string=   he 
    # print
    # "string=%2.7s" % string   # output: string=hello 
    # print
    # "string=%10.7s" % string  # output: string=   hello 
    #    
    # # 还可以用%*.*s来表示精度，两个*的值分别在后面小括号的前两位数值指定 
    # print
    # "string=%*.*s" % (7, 2, string)    # output: string=   he
    #
    # num = 14
    #
    # # %d打印时结果是14
    # print
    # "num=%d" % num  # output: num=14
    #
    # # %1d意思是打印结果为1位整数，当整数的位数超过1位时，按整数原值打印，所以%1d的打印结果还是14
    # print
    # "num=%1d" % num  # output: num=14
    #
    # # %3d意思是打印结果为3位整数，当整数的位数不够3位时，在整数左侧补空格，所以%3d的打印结果是 14
    # print
    # "num=%3d" % num  # output: num= 14
    #
    # # %-3d意思是打印结果为3位整数，当整数的位数不够3位时，在整数右侧补空格，所以%3d的打印结果是14_
    # print
    # "num=%-3d" % num  # output: num=14_
    #
    # # %05d意思是打印结果为5位整数，当整数的位数不够5位时，在整数左侧补0，所以%05d的打印结果是00014
    # print
    # "num=%05d" % num  # output: num=00014
    #
    # # %.3d小数点后面的3意思是打印结果为3位整数，
    # # 当整数的位数不够3位时，在整数左侧补0，所以%.3d的打印结果是014
    # print
    # "num=%.3d" % num  # output: num=014
    #
    # # %.0003d小数点后面的0003和3一样，都表示3，意思是打印结果为3位整数，
    # # 当整数的位数不够3位时，在整数左侧补0，所以%.3d的打印结果还是014
    # print
    # "num=%.0003d" % num  # output: num=014
    #
    # # %5.3d是两种补齐方式的综合，当整数的位数不够3时，先在左侧补0，还是不够5位时，再在左侧补空格，
    # # 规则就是补0优先，最终的长度选数值较大的那个，所以%5.3d的打印结果还是 014
    # print
    # "num=%5.3d" % num  # output: num= 014
    #
    # # %05.3d是两种补齐方式的综合，当整数的位数不够3时，先在左侧补0，还是不够5位时，
    # # 由于是05，再在左侧补0，最终的长度选数值较大的那个，所以%05.3d的打印结果还是00014
    # print
    # "num=%05.3d" % num  # output: num=00014
    #
    # # 还可以用%*.*d来表示精度，两个*的值分别在后面小括号的前两位数值指定
    # # 如下，不过这种方式04就失去补0的功能，只能补空格，只有小数点后面的3才能补0
    # print
    # "num=%*.*d" % (04, 3, num)  # output: num= 014
    #
    # import math
    #
    # # %a.bf，a表示浮点数的打印长度，b表示浮点数小数点后面的精度
    #
    # # 只是%f时表示原值，默认是小数点后5位数
    # print
    # "PI=%f" % math.pi  # output: PI=3.141593
    #
    # # 只是%9f时，表示打印长度9位数，小数点也占一位，不够左侧补空格
    # print
    # "PI=%9f" % math.pi  # output: PI=_3.141593
    #
    # # 只有.没有后面的数字时，表示去掉小数输出整数，03表示不够3位数左侧补0
    # print
    # "PI=%03.f" % math.pi  # output: PI=003
    #
    # # %6.3f表示小数点后面精确到3位，总长度6位数，包括小数点，不够左侧补空格
    # print
    # "PI=%6.3f" % math.pi  # output: PI=_3.142
    #
    # # %-6.3f表示小数点后面精确到3位，总长度6位数，包括小数点，不够右侧补空格
    # print
    # "PI=%-6.3f" % math.pi  # output: PI=3.142_
    #
    # # 还可以用%*.*f来表示精度，两个*的值分别在后面小括号的前两位数值指定
    # # 如下，不过这种方式06就失去补0的功能，只能补空格
    # print
    # "PI=%*.*f" % (06, 3, math.pi)  # output: PI=_3.142

# 用正则提取内容
def tiqu():
    import re
    test = '口碑佳作《驴得水》被许多剧迷称作"神剧"'

    # _info = re.search('《[^》]+》', test, flags=0).group()
    print(bool(re.search('《[^》]+》', test, flags=0)))


# 时间计算的实验
def time():
    import datetime
    a = '2018-02-20'
    b = '2018-03-20'
    startTime = datetime.datetime.strptime(a, '%Y-%m-%d')
    endTime = datetime.datetime.strptime(b, '%Y-%m-%d')
    print(startTime - endTime)


# 去掉头尾的空格
def cleam():
    a = [{"situation": 1, "level": 4, "description": "准妈妈很适合吃包子，包子皮是发面食品，富含B族维生素，而且很容易消化。包子搭配了多种蔬菜和肉类，能够为准妈妈提供各种营养。"},
         {"situation": 2, "level": 4, "description": "坐月子能吃包子，包子皮是发面食品，比较容易消化，适合月子期间食用。"},
         {"situation": 3, "level": 4, "description": "一般情况下，包子都会同时搭配多种蔬菜和肉类，能够做到基本的膳食平衡，适合哺乳妈妈。"},
         {"situation": 4, "level": 4,
          "description": "包子可以通过改变面皮和馅料，做出很多花样来，促排期间和移植后吃包子改善饮食搭配，为人体提供各种营养，所以试管期间是可以吃包子的！"}]

    for i in a:
        i['title'] = '测试数据'

    print(str(a).replace(' ', ''))


# 获得上级地址
def get_path():
    import os
    # 获得当前路径的上级路径
    curPath2 = os.path.dirname(os.getcwd())

    # 获得项目的路径
    curPath = os.path.abspath(__file__)
    print(curPath)


# 查找data
def find():
    import pandas as pd
    test2 = [{'标题': '禾空间儿童剧嘉年华十次卡演出票', '副标题': '多部儿童剧', '地点城市': '武汉', '演出场所': '禾空间小剧场', '演出时间': '2018.10.01-2019.02.28',
              '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 164857, 'imgurl': '1648', '最低票价': 199.0, '最高票价': 199.0,
              '信息属性': 0},
             {'标题': '禾空间儿童剧嘉年华《维小鲸历险记之乘风破浪》', '副标题': '虎鲸偷偷跟上了这艘神秘大船，开启了它的海洋历险。', '地点城市': '武汉', '演出场所': '禾空间小剧场',
              '演出时间': '2018.12.30-2019.01.05', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 165097, 'imgurl': '1650',
              '最低票价': 49.0, '最高票价': 59.0, '信息属性': 0, '剧名': '《维小鲸历险记之乘风破浪》'},
             {'标题': '禾空间嘉年华儿童剧《大头爸爸和小头儿子》', '副标题': '在奇幻森林的南边，有一个奇幻小镇。发生了意想不到的事情', '地点城市': '武汉', '演出场所': '禾空间小剧场',
              '演出时间': '2018.12.12-2019.01.06', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 164860, 'imgurl': '1648',
              '最低票价': 49.0, '最高票价': 59.0, '信息属性': 0, '剧名': '《大头爸爸和小头儿子》'},
             {'标题': '禾空间原创亲子互动剧《神奇动物在这里》', '副标题': '本剧由《格林童话》中《金鸟》、《牧鹅女》、《金鹅》三个故事略加改编而成', '地点城市': '武汉', '演出场所': '禾空间小剧场',
              '演出时间': '2018.12.23-2019.01.13', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 167809, 'imgurl': '1678',
              '最低票价': 59.0, '最高票价': 69.0, '信息属性': 0, '剧名': '《神奇动物在这里》'},
             {'标题': '禾空间首部原创IP人偶儿童剧《熊猫飞飞历险记2之安徒生童话城堡的迷宫》', '副标题': '熊猫飞飞一个人踏上了寻找金禾的旅程。', '地点城市': '武汉', '演出场所': '禾空间小剧场',
              '演出时间': '2019.01.01-01.12', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 168875, 'imgurl': '1688',
              '最低票价': 59.0,
              '最高票价': 69.0, '信息属性': 0, '剧名': '《熊猫飞飞历险记2之安徒生童话城堡的迷宫》'},
             {'标题': '大型系列儿童剧《恐龙王国》之《恐龙王国之南极之旅》', '副标题': '一个好题材，一个好故事', '地点城市': '武汉', '演出场所': '禾空间小剧场',
              '演出时间': '2019.01.06',
              '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 170700, 'imgurl': '1707', '最低票价': 80.0, '最高票价': 100.0,
              '信息属性': 0,
              '剧名': '《恐龙王国》'},
             {'标题': '禾空间小剧场原创惊悚爆笑舞台剧——《goodbye旅行社之黑白先生》', '副标题': '如果一黑一白两个人，非要请你去他们的地盘旅游，你敢去吗？', '地点城市': '武汉',
              '演出场所': '禾空间小剧场', '演出时间': '2018.12.29-2019.01.26', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 168874,
              'imgurl': '1688', '最低票价': 60.0, '最高票价': 100.0, '信息属性': 0, '剧名': '《goodbye旅行社之黑白先生》'},
             {'标题': '武汉·2019年1月大型儿童剧《白雪公主》', '副标题': '根据《格林童话》经典故事改编了《白雪公主》这部儿童剧。', '地点城市': '武汉', '演出场所': '珞珈山剧院',
              '演出时间': '2019.01.06', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 169845, 'imgurl': '1698', '最低票价': 39.0,
              '最高票价': 79.0, '信息属性': 0, '剧名': '《白雪公主》'},
             {'标题': '有趣戏剧第四回 话剧《杏仁豆腐心》武汉站', '副标题': '《杏仁豆腐心》不是年轻情侣间的撕X大戏，而是想借助两颗灵魂的孤独唏嘘，找回我们原本柔软而温暖的内心。', '地点城市': '武汉',
              '演出场所': '403国际艺术中心·红椅剧场', '演出时间': '2019.01.05-01.06', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 170709,
              'imgurl': '1707', '最低票价': 80.0, '最高票价': 280.0, '信息属性': 0, '剧名': '《杏仁豆腐心》'},
             {'标题': '经典成长童话《匹诺曹》--武汉站', '副标题': '经典成长童话《匹诺曹》将给观众带来感动与趣味。', '地点城市': '武汉', '演出场所': '武汉工人文化宫职工剧场',
              '演出时间': '2019.06.15  10:30/15:00', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171025, 'imgurl': '1710',
              '最低票价': 50.0, '最高票价': 260.0, '信息属性': 0, '剧名': '《匹诺曹》'},
             {'标题': '浪漫经典童话剧《灰姑娘》--武汉站', '副标题': '王子能否找到舞会上的灰姑娘？美丽的童话将在今夜绽放！', '地点城市': '武汉', '演出场所': '武汉工人文化宫职工剧场',
              '演出时间': '2019.07.06 10:30/15:00', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171179, 'imgurl': '1711',
              '最低票价': 50.0, '最高票价': 260.0, '信息属性': 0, '剧名': '《灰姑娘》'},
             {'标题': '梦幻互动亲子剧《人鱼公主》--武汉站', '副标题': '这是一次友情、亲情与爱情的启蒙童话之旅', '地点城市': '武汉', '演出场所': '武汉工人文化宫职工剧场',
              '演出时间': '2019.09.07', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171140, 'imgurl': '1711', '最低票价': 50.0,
              '最高票价': 260.0, '信息属性': 0, '剧名': '《人鱼公主》'},
             {'标题': '奇幻亲子音乐剧《绿野仙踪》--武汉站', '副标题': '华丽多变的舞蹈与原创音乐相得益彰，拉开奇幻视觉盛宴的序幕', '地点城市': '武汉', '演出场所': '武汉工人文化宫职工剧场',
              '演出时间': '2019.11.02 10:30/15:00', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171186, 'imgurl': '1711',
              '最低票价': 50.0, '最高票价': 260.0, '信息属性': 0, '剧名': '《绿野仙踪》'},
             {'标题': '寻梦亲子音乐剧《Flight School 飞行学校》--武汉站', '副标题': '励志的故事，动听的音乐，让孩子在音乐剧的世界里找到乐趣，教你在友情、团结中找到梦想。',
              '地点城市': '武汉',
              '演出场所': '武汉工人文化宫职工剧场', '演出时间': '2019.08.10', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171157,
              'imgurl': '1711', '最低票价': 50.0, '最高票价': 260.0, '信息属性': 0, '剧名': '《Flight School 飞行学校》'},
             {'标题': '2019经典再现贺岁喜剧《海底捞月》', '副标题': '本剧通过六十年的麻将生涯，折射出普通百姓酸甜苦辣、大起大落的人生变迁，传奇、暴笑、又让人感慨万千', '地点城市': '武汉',
              '演出场所': '湖北剧院', '演出时间': '2018.12.28-2019.01.22', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 171241,
              'imgurl': '1712', '最低票价': 80.0, '最高票价': 480.0, '信息属性': 0, '剧名': '《海底捞月》'},
             {'标题': '武汉说唱团贺岁剧2019经典再现《海底捞月》', '副标题': '通过六十年的麻将生涯，折射出普通百姓酸甜苦辣、大起大落的人生变迁，传奇、暴笑、又让人感慨万千……', '地点城市': '武汉',
              '演出场所': '湖北剧院', '演出时间': '2018.12.18-2019.01.02', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 168943,
              'imgurl': '1689', '最低票价': 80.0, '最高票价': 480.0, '信息属性': 0, '剧名': '《海底捞月》'},
             {'标题': '江湖爆笑喜剧《萨瓦迪大咖》', '副标题': '一条暧昧微信引发婚姻信任危机！', '地点城市': '武汉', '演出场所': '湖北剧院', '演出时间': '2019.01.16-02.09',
              '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172236, 'imgurl': '1722', '最低票价': 100.0, '最高票价': 380.0,
              '信息属性': 0,
              '剧名': '《萨瓦迪大咖》'},
             {'标题': '音乐剧《搭错车》武汉站', '副标题': '音乐剧坛震撼聚焦，殿堂级音乐剧《搭错车》2019年3月8日经典重现武汉！', '地点城市': '武汉', '演出场所': '湖北剧院',
              '演出时间': '2019.03.08 19:30', '演出状态': '预售', '演出类型': '音乐剧', 'projectid': 172514, 'imgurl': '1725',
              '最低票价': 199.0,
              '最高票价': 999.0, '信息属性': 0, '剧名': '《搭错车》'},
             {'标题': '话剧《蒋公的面子》', '副标题': '这是一个后辈学生根据校史传说虚构的关于前辈老师和校长的故事。', '地点城市': '武汉', '演出场所': '湖北剧院',
              '演出时间': '2019.04.27 19:30', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172018, 'imgurl': '1720',
              '最低票价': 100.0,
              '最高票价': 870.0, '信息属性': 0, '剧名': '《蒋公的面子》'},
             {'标题': '武汉年度C位爆笑喜剧《抹茶攻略》', '副标题': '有如手工钟表般精密的结构喜剧。', '地点城市': '武汉', '演出场所': '湖北剧院',
              '演出时间': '2019.12.09-2019.01.04', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 169604, 'imgurl': '1696',
              '最低票价': 110.0, '最高票价': 480.0, '信息属性': 0, '剧名': '《抹茶攻略》'},
             {'标题': '武汉人艺大型原创话剧《王荷波》专场演出', '副标题': '王荷波波澜壮阔的人生中，截取了建党初期、大革命高潮和陷入困境的三个不同时期的故事', '地点城市': '武汉',
              '演出场所': '中南剧场大剧场', '演出时间': '2019.01.09', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172698,
              'imgurl': '1726',
              '最低票价': 30.0, '最高票价': 160.0, '信息属性': 0, '剧名': '《王荷波》'},
             {'标题': 'MaiLive 孟京辉戏剧作品《两只狗的生活意见》武汉站', '副标题': '他们决定勇敢地面对生活，不管生活有多艰辛，一定要勇敢地走下去！', '地点城市': '武汉',
              '演出场所': '中南剧场大剧场', '演出时间': '2019.01.11-01.13', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 163615,
              'imgurl': '1636', '最低票价': 100.0, '最高票价': 480.0, '信息属性': 0, '剧名': '《两只狗的生活意见》'},
             {'标题': 'MaiLive 孟京辉戏剧作品《九又二分之一爱情》武汉站', '副标题': '讲述了一个关于爱与复仇的当代寓言。', '地点城市': '武汉', '演出场所': '中南剧场大剧场',
              '演出时间': '2019.04.26-04.28', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172118, 'imgurl': '1721',
              '最低票价': 100.0,
              '最高票价': 480.0, '信息属性': 0, '剧名': '《九又二分之一爱情》'},
             {'标题': 'MaiLive 孟京辉戏剧作品《我爱XXX》武汉站', '副标题': '语言本身不具备意义，却是我们生存的唯一现实，我们与它相依为命。', '地点城市': '武汉',
              '演出场所': '中南剧场大剧场',
              '演出时间': '2019.03.15-03.16', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172094, 'imgurl': '1720',
              '最低票价': 100.0,
              '最高票价': 480.0, '信息属性': 0, '剧名': '《我爱XXX》'},
             {'标题': 'MaiLive孟京辉戏剧作品《一个陌生女人的来信》武汉站', '副标题': '讲述陌生女人和W先生"三次做饭与三次交欢"的疯狂爱情。', '地点城市': '武汉',
              '演出场所': '中南剧场大剧场',
              '演出时间': '2019.05.03-05.05', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172121, 'imgurl': '1721',
              '最低票价': 100.0,
              '最高票价': 480.0, '信息属性': 0, '剧名': '《一个陌生女人的来信》'},
             {'标题': 'MaiLive 孟京辉经典戏剧作品《恋爱的犀牛》武汉站', '副标题': '当代中国戏剧旗帜性作品，永远的爱情圣经', '地点城市': '武汉', '演出场所': '中南剧场大剧场',
              '演出时间': '2019.03.29-03.31', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172122, 'imgurl': '1721',
              '最低票价': 100.0,
              '最高票价': 480.0, '信息属性': 0, '剧名': '《恋爱的犀牛》'},
             {'标题': 'MaiLive 孟京辉经典音乐剧作品《空中花园谋杀案》武汉站', '副标题': '整个城市为了空中花园而疯狂!新的谋杀即将开始……', '地点城市': '武汉',
              '演出场所': '中南剧场大剧场',
              '演出时间': '2019.06.28-06.30', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172089, 'imgurl': '1720',
              '最低票价': 100.0,
              '最高票价': 480.0, '信息属性': 0, '剧名': '《空中花园谋杀案》'},
             {'标题': '原创话剧《这些年》', '副标题': '以小人物的视角真实质朴的展现了普通人在时代大浪中的命运变化', '地点城市': '武汉', '演出场所': '武汉人民艺术剧院-D5空间',
              '演出时间': '2018.12.31-2019.01.26', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172111, 'imgurl': '1721',
              '最低票价': 50.0, '最高票价': 50.0, '信息属性': 0, '剧名': '《这些年》'},
             {'标题': '儿童剧《小蝌蚪找妈妈》', '副标题': '青蛙妈妈和小蝌蚪们终于团聚。妈妈给孩子们上了有意义的人生第一课。', '地点城市': '武汉', '演出场所': '武汉人民艺术剧院-亲子剧场',
              '演出时间': '2018.01.05-01.27', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 170767, 'imgurl': '1707',
              '最低票价': 50.0,
              '最高票价': 50.0, '信息属性': 0, '剧名': '《小蝌蚪找妈妈》'},
             {'标题': '开心麻花2019爆笑贺岁舞台剧《窗前不止明月光》', '副标题': '开心麻花爆笑推荐超“毒舌”台词根本停不下来！', '地点城市': '武汉', '演出场所': '武汉剧院',
              '演出时间': '2019.01.18-01.19', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 169863, 'imgurl': '1698',
              '最低票价': 100.0,
              '最高票价': 880.0, '信息属性': 0, '剧名': '《窗前不止明月光》'},
             {'标题': '凡创文化·大型恐龙主题实景童话剧《你看起来好像很好吃》', '副标题': '《你看起来好像很好吃》给所有的恐龙们都编排了极富童趣的舞蹈。', '地点城市': '武汉',
              '演出场所': '武汉剧院',
              '演出时间': '2019.04.14 10:30', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 170724, 'imgurl': '1707',
              '最低票价': 100.0, '最高票价': 1500.0, '信息属性': 0, '剧名': '《你看起来好像很好吃》'},
             {'标题': '开心麻花2019爆笑贺岁舞台剧《谈判专家》', '副标题': '开心麻花原创贺岁舞台剧', '地点城市': '武汉', '演出场所': '武汉剧院',
              '演出时间': '2019.03.07-03.10',
              '演出状态': '售票中', '演出类型': '话剧', 'projectid': 172146, 'imgurl': '1721', '最低票价': 100.0, '最高票价': 1320.0,
              '信息属性': 0,
              '剧名': '《谈判专家》'},
             {'标题': '世界原版经典音乐剧《猫》CATS-武汉站', '副标题': '世界原版经典音乐剧《猫》2019中国“猫”年震撼回归', '地点城市': '武汉', '演出场所': '武汉剧院',
              '演出时间': '2019.06.21-06.26', '演出状态': '预售', '演出类型': '音乐剧', 'projectid': 172365, 'imgurl': '1723',
              '最低票价': 280.0,
              '最高票价': 1380.0, '信息属性': 0, '剧名': '《猫》'},
             {'标题': '托马斯&朋友—迷失宝藏', '副标题': '英国儿童电视动画剧《Thomas&Friends》改编', '地点城市': '武汉', '演出场所': '武汉剧院',
              '演出时间': '2019.06.01',
              '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171837, 'imgurl': '1718', '最低票价': 80.0, '最高票价': 600.0,
              '信息属性': 0},
             {'标题': '小鬼当家系列亲子剧《神秘大盗》', '副标题': '寓教于乐，告诉小朋友们乐于助人、拾金不昧的教育理念', '地点城市': '武汉', '演出场所': '亦言堂·南湖天地剧场',
              '演出时间': '2019.01.05-01.26', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171662, 'imgurl': '1716',
              '最低票价': 100.0, '最高票价': 100.0, '信息属性': 0, '剧名': '《神秘大盗》'},
             {'标题': '九町舞台剧《游侠小红帽》', '副标题': '经典儿童剧改编，让短小平淡的故事更加丰满', '地点城市': '武汉', '演出场所': '亦言堂·南湖天地剧场',
              '演出时间': '2018.12.22-2019.01.26', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171665, 'imgurl': '1716',
              '最低票价': 50.0, '最高票价': 50.0, '信息属性': 0, '剧名': '《游侠小红帽》'},
             {'标题': '江城爱情故事系列舞台剧《缘来是你》', '副标题': '江诚也发现了自己爷爷的日记，一段民国时期的爱情故事呈现在两人眼前……', '地点城市': '武汉',
              '演出场所': '亦言堂·南湖天地剧场',
              '演出时间': '2018.12.21-2019.01.25', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 171652, 'imgurl': '1716',
              '最低票价': 100.0, '最高票价': 100.0, '信息属性': 0, '剧名': '《缘来是你》'},
             {'标题': '九町舞台剧《老婆梦工厂》', '副标题': '通过欢乐多彩的舞台呈现，讲述了"一见钟情"式的爱情体验。', '地点城市': '武汉', '演出场所': '亦言堂·南湖天地剧场',
              '演出时间': '2019.01.05-01.27', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 171664, 'imgurl': '1716',
              '最低票价': 50.0,
              '最高票价': 50.0, '信息属性': 0, '剧名': '《老婆梦工厂》'},
             {'标题': '《海底小纵队4：极地大冒险》武汉站', '副标题': '英国版权引进，海洋探险故事奇幻，开发想象力，魅力无穷。', '地点城市': '武汉', '演出场所': '武汉琴台大剧院',
              '演出时间': '2019.01.05 19:30', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 169531, 'imgurl': '1695',
              '最低票价': 60.0,
              '最高票价': 780.0, '信息属性': 0, '剧名': '《海底小纵队4：极地大冒险》'},
             {'标题': '舞台剧《剑网3·曲云传》武汉站', '副标题': '高度还原的游戏场景和故事剧情，让你笑着流泪，哭着感动！', '地点城市': '武汉', '演出场所': '武汉琴台大剧院',
              '演出时间': '2019-01-13 14:30', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 171016, 'imgurl': '1710',
              '最低票价': 188.0,
              '最高票价': 988.0, '信息属性': 0, '剧名': '《剑网3·曲云传》'},
             {'标题': '黑色喜剧《驴得水》武汉站', '副标题': '口碑佳作《驴得水》被许多剧迷称作"神剧"', '地点城市': '武汉', '演出场所': '武汉琴台大剧院',
              '演出时间': '2019-01-06',
              '演出状态': '售票中', '演出类型': '话剧', 'projectid': 171739, 'imgurl': '1717', '最低票价': 80.0, '最高票价': 380.0,
              '信息属性': 0,
              '剧名': '《驴得水》'},
             {'标题': '大型音乐舞台剧《犹太城》武汉站', '副标题': '讲述二战期间德国纳粹占领和控制下的维尔纽斯犹太城里发生的故事。', '地点城市': '武汉', '演出场所': '武汉琴台大剧院',
              '演出时间': '2019.01.20   19:30', '演出状态': '售票中', '演出类型': '歌舞剧', 'projectid': 169510, 'imgurl': '1695',
              '最低票价': 80.0, '最高票价': 1199.0, '信息属性': 0, '剧名': '《犹太城》'},
             {'标题': '大型冒险式儿童舞台剧《圆梦恐龙岛》武汉站', '副标题': '友情，亲情，团结，正能量', '地点城市': '武汉', '演出场所': '武汉琴台大剧院',
              '演出时间': '2019.01.27 19:30', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 172846, 'imgurl': '1728',
              '最低票价': 60.0,
              '最高票价': 560.0, '信息属性': 0, '剧名': '《圆梦恐龙岛》'},
             {'标题': '音乐剧《灰姑娘》中文版（武汉站）', '副标题': '', '地点城市': '武汉', '演出场所': '武汉琴台大剧院', '演出时间': '2019.01.03-01.04',
              '演出状态': '售票中', '演出类型': '音乐剧', 'projectid': 579053572399, 'imgurl': '1495568427', '最低票价': 50.0,
              '最高票价': 480.0,
              '信息属性': 0, '剧名': '《灰姑娘》'},
             {'标题': '保利原创儿童剧《故宫里的小不点》武汉站', '副标题': '为广大小朋友及家长们带来奇幻视觉盛宴', '地点城市': '武汉', '演出场所': '武汉琴台大剧院',
              '演出时间': '2019.01.15 19:30', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171231, 'imgurl': '1712',
              '最低票价': 80.0,
              '最高票价': 760.0, '信息属性': 0, '剧名': '《故宫里的小不点》'},
             {'标题': '沉浸式儿童体验3D游戏剧《爱丽丝梦游仙境》', '副标题': '爱丽丝从小脑袋里就装着各种奇思妙想，因为追一只揣着怀表、会说话的兔子，她掉进了树洞，开始了一段奇幻之旅。',
              '地点城市': '武汉',
              '演出场所': '荟聚购物中心外广场南大门G区停车场', '演出时间': '2018.10.01-2019.01.20', '演出状态': '售票中', '演出类型': '儿童剧',
              'projectid': 164159, 'imgurl': '1641', '最低票价': 88.0, '最高票价': 88.0, '信息属性': 0, '剧名': '《爱丽丝梦游仙境》'},
             {'标题': '英国音乐戏剧秀《欢乐颂》', '副标题': '来自英国的JunNK剧团由四位神秘逗咖爆笑上演，', '地点城市': '武汉', '演出场所': '汤湖戏院',
              '演出时间': '2019.01.04',
              '演出状态': '售票中', '演出类型': '音乐剧', 'projectid': 171144, 'imgurl': '1711', '最低票价': 60.0, '最高票价': 120.0,
              '信息属性': 0,
              '剧名': '《欢乐颂》'},
             {'标题': '武汉说唱团爆笑神剧《海底捞月》', '副标题': '本剧通过六十年的麻将生涯，折射出普通百姓酸甜苦辣、大起大落的人生变迁。', '地点城市': '武汉', '演出场所': '汤湖戏院',
              '演出时间': '2018.12.29-2019.02.19', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 169619, 'imgurl': '1696',
              '最低票价': 80.0, '最高票价': 180.0, '信息属性': 0, '剧名': '《海底捞月》'}]

    test1 = [{'标题': '大型冒险式儿童舞台剧《圆梦恐龙岛》武汉站', '副标题': '友情，亲情，团结，正能量', '地点城市': '武汉', '演出场所': '武汉琴台大剧院',
              '演出时间': '2019.01.27 19:30', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 172846, 'imgurl': '1728',
              '最低票价': 60.0,
              '最高票价': 560.0, '信息属性': 0, '剧名': '《圆梦恐龙岛》'},
             {'标题': '音乐剧《灰姑娘》中文版（武汉站）', '副标题': '', '地点城市': '武汉', '演出场所': '武汉琴台大剧院', '演出时间': '2019.01.03-01.04',
              '演出状态': '售票中', '演出类型': '音乐剧', 'projectid': 579053572399, 'imgurl': '1495568427', '最低票价': 50.0,
              '最高票价': 480.0,
              '信息属性': 0, '剧名': '《灰姑娘》'},
             {'标题': '保利原创儿童剧《故宫里的小不点》武汉站', '副标题': '为广大小朋友及家长们带来奇幻视觉盛宴', '地点城市': '武汉', '演出场所': '武汉琴台大剧院',
              '演出时间': '2019.01.15 19:30', '演出状态': '售票中', '演出类型': '儿童剧', 'projectid': 171231, 'imgurl': '1712',
              '最低票价': 80.0,
              '最高票价': 760.0, '信息属性': 0, '剧名': '《故宫里的小不点》'},
             {'标题': '沉浸式儿童体验3D游戏剧《爱丽丝梦游仙境》', '副标题': '爱丽丝从小脑袋里就装着各种奇思妙想，因为追一只揣着怀表、会说话的兔子，她掉进了树洞，开始了一段奇幻之旅。',
              '地点城市': '武汉',
              '演出场所': '荟聚购物中心外广场南大门G区停车场', '演出时间': '2018.10.01-2019.01.20', '演出状态': '售票中', '演出类型': '儿童剧',
              'projectid': 164159, 'imgurl': '1641', '最低票价': 88.0, '最高票价': 88.0, '信息属性': 0, '剧名': '《爱丽丝梦游仙境》'},
             {'标题': '英国音乐戏剧秀《欢乐颂》', '副标题': '来自英国的JunNK剧团由四位神秘逗咖爆笑上演，', '地点城市': '武汉', '演出场所': '汤湖戏院',
              '演出时间': '2019.01.04',
              '演出状态': '售票中', '演出类型': '音乐剧', 'projectid': 171144, 'imgurl': '1711', '最低票价': 60.0, '最高票价': 120.0,
              '信息属性': 0,
              '剧名': '《欢乐颂》'},
             {'标题': '武汉说唱团爆笑神剧《海底捞月》', '副标题': '本剧通过六十年的麻将生涯，折射出普通百姓酸甜苦辣、大起大落的人生变迁。', '地点城市': '武汉', '演出场所': '汤湖戏院',
              '演出时间': '2018.12.29-2019.02.19', '演出状态': '售票中', '演出类型': '话剧', 'projectid': 169619, 'imgurl': '1696',
              '最低票价': 80.0, '最高票价': 180.0, '信息属性': 0, '剧名': '《海底捞月》'}]
    df = pd.DataFrame(test2)

    df2 = pd.DataFrame(test1)
    for i in df.iterrows():
        ddff = pd.concat([df, i[1]])
        print(ddff)

    # df3 = pd.DataFrame({'BoolCol': [3, 55]})

    # for i in df3.iterrows():
    #
    #     # 临时参数
    #     _i = i[1]
    #     print(df[df['BoolCol']==_i['BoolCol']])
    #
    #
    #
    #     #以X为依据，判断是否重复
    #     if df[df['BoolCol']==_i['BoolCol']].index.tolist():
    #         # if   _i['标题']:
    #         print('重复')
    # print(df ,'\n')
    # a = df[(df.BoolCol == 32) & (df.attr == 22)].index.tolist()
    # # print(df[(df.BoolCol == 3) & (df.attr == 22)])
    # # if df[df.BoolCol == 32].index.tolist() is True:
    # print(df[df.BoolCol BoolCol== 32].index.tolist())


# 保存data到csv
def to_csv():
    import pandas as pd
    df = pd.DataFrame({'BoolCol': [1, 2, 3, 3, 4], 'attr': [22, 33, 22, 44, 66]})
    df.to_csv('history.csv', )


# 测试代理是否可用
def GetUseProxies():
    # coding=utf-8
    import requests
    # '''测试代理是否可用'''
    UseProxiesList = []
    i = 1
    n = 0
    # 请求api返回代理列表
    api = "http://qsrdk.daili666api.com/ip/?&num=100&category=2&sortby=time"

    api_url = requests.get(api)

    proxies_list = api_url.content.split('\r\n')
    print('获得proiex%s' % len(proxies_list))
    for proxy in proxies_list:
        print('正在发送第%s个请求。\n\r' % i)
        i += 1
        proxies = {"http": "http://" + proxy, "https": "http://" + proxy, }
        try:
            requests.get('http://www.baidu.com', proxies=proxies, timeout=2)
            UseProxiesList.append(proxy)
        except:
            n += 1
            print('***已经有%s个代理被淘汰***' % n)
            print('UseProxiesList:', UseProxiesList)
            print('可用代理数量%s' % len(UseProxiesList))


# 分词测试
def fenxi():
    import jieba
    from wordcloud import WordCloud, STOPWORDS, ImageColorGenerator

    wc = WordCloud(background_color='white',  # 背景颜色
                   max_words=1000,  # 最大词数
                   # mask=back_color,  # 以该参数值作图绘制词云，这个参数不为空时，width和height会被忽略
                   max_font_size=100,  # 显示字体的最大值
                   stopwords=STOPWORDS.add('苟利国'),  # 使用内置的屏蔽词，再添加'苟利国'
                   font_path="C:/Windows/Fonts/STFANGSO.ttf",  # 解决显示口字型乱码问题，可进入C:/Windows/Fonts/目录更换字体
                   random_state=42,  # 为每个词返回一个PIL颜色
                   # width=1000,  # 图片的宽
                   # height=860  #图片的长
                   )

    jieba.add_word('海尔茂')

    txt = open('Init.txt', encoding='utf-8').read().replace("\n", "").replace(' ', '')

    txt2 = [line.strip() for line in open('stoptxt.txt', encoding='utf-8').readlines()]

    words = jieba.lcut(txt)
    en = {}

    for i in words:
        if i not in txt2:
            en[i] = en.get(i, 0) + 1

    items = list(en.items())

    items.sort(key=lambda x: x[1], reverse=True)

    for i in range(100):
        # word,count = items[i]
        print(items[i])
    wc.generate(text)


# 停用此测试
def stopkey():
    import jieba
    path1 = 'stoptxt.txt'
    path2 = 'stop2.txt'
    test = '达郎向小叶子仔细描述他们夭折的孩子被火化的情景.'
    words = jieba.cut(test)  # 去除HTML标签


# 分词案例
def fenci():
    import jieba.analyse
    print("***案例1***" * 3)
    txt = '那些你很冒险的梦，我陪你去疯，折纸飞机碰到雨天终究会坠落，伤人的话我直说，因为你会懂，冒险不冒险你不清楚，折纸飞机也不会回来，做梦的人睡不醒！'
    Key = jieba.analyse.extract_tags(txt, topK=3)
    print(Key)
    # -----------------------------------------------------------------------------------
    print("***案例2***" * 3)
    # 字符串前面加u表示使用unicode编码
    content = u'中国特色社会主义是我们党领导的伟大事业，全面推进党的建设新的伟大工程，是这一伟大事业取得胜利的关键所在。党坚强有力，事业才能兴旺发达，国家才能繁荣稳定，人民才能幸福安康。党的十八大以来，我们党坚持党要管党、从严治党，凝心聚力、直击积弊、扶正祛邪，党的建设开创新局面，党风政风呈现新气象。习近平总书记围绕从严管党治党提出一系列新的重要思想，为全面推进党的建设新的伟大工程进一步指明了方向。'
    # 第一个参数：待提取关键词的文本
    # 第二个参数：返回关键词的数量，重要性从高到低排序
    # 第三个参数：是否同时返回每个关键词的权重
    # 第四个参数：词性过滤，为空表示不过滤，若提供则仅返回符合词性要求的关键词
    keywords = jieba.analyse.extract_tags(content, topK=5, withWeight=True, allowPOS=())
    # 访问提取结果
    for item in keywords:
        # 分别为关键词和相应的权重
        print(item[0], item[1])

    # 同样是四个参数，但allowPOS默认为('ns', 'n', 'vn', 'v')
    # 即仅提取地名、名词、动名词、动词
    keywords = jieba.analyse.textrank(content, topK=5, withWeight=True, allowPOS=('ns', 'n', 'vn', 'v'))
    # 访问提取结果
    for item in keywords:
        # 分别为关键词和相应的权重
        print(item[0], item[1])


# 数据库操作
import pymongo


class get_db:

    # info 为一个数组，type是字符串"douban"/"damai"
    def __init__(self):
        self.test1 = [{'演出场所': '武汉琴台大剧院', '演出时间': '2019.01.27 19:30', '剧名': '《圆梦恐龙岛》'},
                      {'演出场所': '武汉琴台大剧院', '演出时间': '2019.01.03-01.04', '剧名': '《灰姑娘》'},
                      {'演出场所': '武汉琴台大剧院', '演出时间': '2019.01.15 19:30', '剧名': '《故宫里的小不点》'}
                      ]
        self.test2 = [{'演出场所': '武汉琴台大剧院', '演出时间': '2019.01.03-01.04', '剧名': '《灰姑娘》'},
                 {'演出场所': '武汉琴台大剧院', '演出时间': '2019.01.16', '剧名': '《故宫里的小不点》'},
                 {'演出场所': '荟聚购物中心外广场南大门G区停车场', '演出时间': '2018.10.01-2019.01.20', '剧名': '《爱丽丝梦游仙境》'},
                 {'演出场所': '汤湖戏院', '演出时间': '2019.01.04', '剧名': '《欢乐颂》'},
                 {'演出场所': '武汉琴台大剧院', '演出时间': '2018.12.29-2019.02.19', '剧名': '《海底捞月》'},
                 {'演出场所': '武汉琴台大剧院', '演出时间': '2019.01.15 19:30', '剧名': '《故宫里的小不点》'}
                 ]
        #数据库地址
        self.myclient = pymongo.MongoClient('mongodb://localhost:27017/')

        #数据库名字
        self.mydb = self.myclient["swarm"]

        #数据表名字
        self.db_name = 'test'

        self.type = type

    # 豆瓣数据储存
    def save(self):

        mycol = self.mydb[self.db_name]

        # _test = mycol.insert_many(self.test1)

        for i in mycol.find({'剧名': '《灰姑娘》'}):
            print(i)

        # 测试数据
        print('保存成功！')


#设置配置文件
def conf():



if __name__ == '__main__':
    get_db().save()

    # tiqu()
